4-4BSD/robert/man/man1/robert.1
.\"
.\" Copyright (c) 2026 llmrb
.\"
.\" Permission to use, copy, modify, and/or distribute this software for
.\" any purpose with or without fee is hereby granted.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd June 5, 2026
.Dt ROBERT 1
.Os
.Sh NAME
.Nm robert
.Nd learn and troubleshoot FreeBSD from the terminal
.Sh SYNOPSIS
.Nm
.Op Fl dxhv
.Sh DESCRIPTION
.Nm
is designed to help you learn and troubleshoot FreeBSD using official
documentation, manual pages, source code, ports, and packages.
It explains what to do and why, while leaving system changes in your
hands.
.Nm
runs in the terminal and is distributed as a standalone, 3MB binary
with no Node.js, Electron, browser, Ruby installation, or gem bundle
dependency.
.Pp
Robert uses
.Ev DEEPSEEK_SECRET
to authenticate with the model provider, and answers questions by
searching manual pages, the FreeBSD handbooks, the filesystem, ports
metadata, and package metadata.
Answers are grounded in cited excerpts from official documentation, not
model training data.
.Pp
.Nm
is read-only by design: it can inspect documentation, ports, packages,
source code, and approved files, but it does not write data or automate
system changes.
.Pp
The options are as follows:
.Bl -tag -width indent
.It Fl d
Enable debug logging.
.It Fl x
Allow tools to run without confirmation.
.It Fl h
Show usage information and exit.
.It Fl v
Print the version of
.Nm
and exit.
.El
.Sh ENVIRONMENT
.Bl -tag -width DEEPSEEK_SECRET
.It Ev DEEPSEEK_SECRET
The API key used to authenticate with the model provider.
.It Ev PORTSDIR
The local ports tree used by the
.Ic find-port
and
.Ic read-port
tools.
Defaults to
.Pa /usr/ports .
.El
.Sh FILES
.Bl -tag -width /usr/share/man -compact
.It Pa /usr/share/man
The manual page database used by
.Nm
to search for and read man pages.
.It Pa /usr/ports
The default ports tree used by
.Nm
to search for and read port metadata.
.El
.Sh TOOLS
The following tools are available:
.Bl -tag -width "search-developer-handbook"
.It Ic man-page
Read a manual page by name and optional section.
.It Ic man-search
Search the manual page database using
.Xr apropos 1 .
.It Ic search-user-handbook
Search the FreeBSD user's handbook with full-text search.
.It Ic search-developer-handbook
Search the FreeBSD developer's handbook with full-text search.
.It Ic search-porter-handbook
Search the FreeBSD porter's handbook with full-text search.
.It Ic read-file
Read a text file from the filesystem.
This tool requires confirmation before execution.
.It Ic find
Search for files and directories from a root path.
This tool requires confirmation before execution.
.It Ic grep
Search for text across files below a root path.
This tool requires confirmation before execution.
.It Ic find-port
Search a local ports tree for a port name.
.It Ic read-port
Read a port's
.Pa Makefile ,
.Pa pkg-descr ,
and
.Pa distinfo .
.It Ic read-package
Read exact package metadata from the
.Xr pkg 8
database.
.It Ic find-package
Search the
.Xr pkg 8
database for package origins.
.It Ic version
Report the
.Nm
version number.
.El
.Sh EXIT STATUS
.Ex -std
.Sh SEE ALSO
.Xr apropos 1 ,
.Xr man 1
.Sh AUTHORS
.An 0x1eef <0x1eef@hardenedbsd.org>
